---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.NumPanels
source: html/b98ff0b0-8d33-8f28-7625-4abf5060ecb2.htm
---
# Autodesk.Revit.DB.CurtainGrid.NumPanels Property

The number of panels.

## Syntax (C#)
```csharp
public int NumPanels { get; }
```